Repository: elapouya/django-listing
Catalog: django_listing/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Move up
fr: En haut

source: Change order up
fr: Change l'ordre vers le haut

source: Move down
fr: En bas

source: Change order down
fr: Change l'ordre vers le bas

source: Details
fr: Détails

source: See details
fr: Voir les détails

source: Edit
fr: Éditer

source: Delete
fr: Effacer

source: Not set
fr: Non défini

source: You must specify a layout in view_object_popup__layout
fr: Vous devez spécifier un layout dans view_object_popup__layout

source: Object id not specified !
fr: Object id non specifié !

source: *** Not a valid column name ***
fr: *** Nom de colonne invalide ***

source: Unknown "{}" aggregation, choose one of these : {}
fr: aggrégation "{}" inconnue, choisir une de celles-ci : {}

source: Min : {min_val}<br>Max : {max_val}<br>Avg : {avg_val:.{col.footer_precision}f}
fr: Min : {min_val}<br>Max : {max_val}<br>Moy : {avg_val:.{col.footer_precision}f}

# Attached form
source: Reset
fr: R.A.Z

# Attached form
source: Add
fr: Ajouter

# Attached form
source: Delete ALL
fr: Tout supprimer

# Attached form
source: Delete selected
fr: Supprimer la sélection

# Attached form
source: Clear the form
fr: Effacer le formulaire

# Attached form
source: Insert
fr: Insérer

# Attached form
source: Duplicate
fr: Dupliquer

# Attached form
source: Update selected
fr: Modifier la sélection

# Attached form
source: Update ALL
fr: Tout modifier

source: In the {form_name} layout you specified the field "{field_name}" but there is no existing listing column with that name nor listing method "{attrname}"nor attached_form param "{key}"
fr: Dans le layout de {form_name} vous avez spécifié le champ "{field_name}" mais il n'y a aucune colonne avec ce nom ni de méthode "{attrname}" ni de paramètre de formulaire attaché "{key}" dans le listing

source: You must specify a list of columns names in the form layout
fr: Vous devez spécifier une liste de noms de colonnne dans le layout de formulaire

source: column {col_id} of listing {listing} is not a Column instance (class = {colclass})
fr: colonne {col_id} du listing {listing} n'est pas une instance de Column (class = {colclass})

source: Please choose...
fr: Choisir...

source: Yes
fr: Oui

source: No
fr: Non

source: {} is not a valid django forms field class
fr: {} n'est pas une classs de champs de formulaire django valide

source: {} is not a valid django forms widget class
fr: {} n'est pas une classe de widget de formulaire django valide

source: Cannot find choices from model for filter "{name}", Please specify the choices to display
fr: Ne trouve pas 'choices' du modèle de filtrage "{name}", merci de spécifier les choix à afficher

source: Please specify the choices to display for filter "{name}"
fr: Merci de spécifier les choix à afficher pour le filtre "{name}"

source: True
fr: Vrai

source: False
fr: Faux

source: Button
fr: Bouton

source: <td{attrs}>Overall Min:<br>{value}</td>
fr: <td{attrs}>Minimum:<br>{value}</td>

source: <td{attrs}>Overall Max:<br>{value}</td>
fr: <td{attrs}>Maximum:<br>{value}</td>

source: Average
fr: Moyenne

source: <td{attrs}>Overall avg:<br>{value:.{col.footer_precision}f}</td>
fr: <td{attrs}>Moyenne:<br>{value:.{col.footer_precision}f}</td>

# verb
source: Filter
fr: Filtrer

# Filters form
source: Reset
fr: Effacer

# Filters form
source: Filter
fr: Filtrer

# Filters form
source: Advanced
fr: Avancé

source: Cannot find filter "{name}" definition
fr: Ne trouve pas la définition du filtre"{name}"

source: - No filtering -
fr: - Pas de filtrage -

source: Greater than or equal to
fr: Plus grand ou égal à

source: Greater than to
fr: Plus grand que

source: Less than or equal to
fr: Plus petit ou égal à

source: Less than to
fr: Plus petit que

source: Use CTRL+click to select/deselect multiple choices
fr: Utiliser CTRL+click pour (dé-)sélectionner plusieurs choix

source: Select a value...
fr: Selectionnez une valeur...

# abbreviation
source: Avg
fr: Moyenne

# action button
source: Cancel
fr: Annuler

# action button
source: Edit
fr: Éditer

# action button
source: Update
fr: Mettre à jour

# action button
source: Upload
fr: Téléverser

source: Do you really want to DELETE {nb_items} item(s) ?
fr: Voulez-vous vraiment EFFACER {nb_items} élément(s) ?

source: Do you really want to UPDATE {nb_items} items ?
fr: Voulez-vous vraiment MODIFIER {nb_items} élément(s) ?

source: WARNING : Do you really want to UPDATE absolutely ALL {nb_all_items} items ? This will process ALL items in ALL pages in the actual listing. Note that it will take in account the filter : only filtered items will be processed. IMPORTANT : Check that all form's fields are empty except those you want to update. You can use the CLEAR button to make all fields empty, then fill only one or more fields with value(s) you want to apply on all items.
fr: ATTENTION : Voulez-vous vraiment MODIFIER absolument TOUS les {nb_all_items} éléments ? Cela se fera sur TOUS les éléments de TOUTES les pages de l'actuel listing. Notez que cela prend en compte le filtrage : seuls les éléments filtrés seront pris en compte.

source: WARNING : Do you really want to DELETE absolutely ALL {nb_all_items} items ? This will process ALL items in ALL pages in the actual listing. Note that it will take in account the filter : only filtered items will be processed.
fr: ATTENTION : Voulez-vous vraiment EFFACER absolument TOUS les {nb_all_items} éléments ? Cela se fera sur TOUS les éléments de TOUTES les pages de l'actuel listing. Notez que cela prend en compte le filtrage : seuls les éléments filtrés seront pris en compte.

source: Please configure at least one column in your listing
fr: Merci de configurer au moins une colonne dans votre listing

source: [CANNOT_EDIT_IN_AJAX]
fr: On ne peut pas éditer un listing en mode ajax, merci de retirer accept_ajax=True

source: record
fr: enregistrement

source: records
fr: enregistrements

source: There is no %s to display.
fr: Il n'y a aucun %s à afficher.

source: [You do not have permission to export data]
fr: Vous n'avez pas la permission d'exporter les données

source: [You cannot export when there are more than {} rows in listing]
fr: Vous ne pouvez pas exporter quand il y a plus de {} lignes de listing

source: [Listing export]
fr: Export du listing

source: Sort by:
fr: Trier par :

# paginator
source: Page {page_number} of {nb_pages}
fr: Page {page_number} sur {nb_pages}

# paginator
source: {row_first}-{row_last} of {nb_rows}
fr: {row_first}-{row_last} sur {nb_rows}

# paginator
source: Previous
fr: Précédente

# paginator
source: Next
fr: Suivante

# paginator
source: First
fr: Première

# paginator
source: Last
fr: Dernière

# paginator
source: Go to page {goto_form}
fr: Aller à la page {goto_form}

source: The listing can only display the first %s rows. Please use filtering to narrow your listing.
fr: Le listing ne peut afficher que les %s premières lignes. Merci d'utiliser le filtrage pour réduire le listing.

source: Getting all records is only supported on SMALL sequence data, not on Django querysets
fr: Obtenir tous les enregistrement est seulement supporté sur les PETITES liste de données, Pas sur les querysets Django

source: field "{field}" must be an integer, please choose the correct field that will be used to change object ordering
fr: Le champ "{field}" doit être un entier, merci de choisir un champ correct pour la gestion de l'ordre des objets

source: Listing data must be a sequence or a QuerySet.
fr: Les données pour un listing doit une séquence ou un QuerySet.

source: Please select a file format !
fr: Merci de sélectionner un format de fichier !

source: [Ungroup]
fr: Dégrouper

source: Please use checkboxes to select one or more fields to mass update
fr: Veuillez utiliser les checkbox pour sélectionner les champs avec lesquels faire une MAJ en masse

source: [Available columns]
fr: Colonnes disponibles

source: [Selected columns]
fr: Colonnes sélectionnées

source: Sort by
fr: Trier par

source: Sort by...
fr: Trier par...

source: Per page
fr: Par page

source: Per page...
fr: Par page...

source: Choose...
fr: Choisir...

source: Export to...
fr: Exporter vers...

source: Update
fr: Actualiser

source: Select all
fr: Tout selectionner

source: Unselect all
fr: Tout désélectionner

source: Invert selection
fr: Inverser la sélection

source: Group by...
fr: Grouper par...

source: <b>{object}</b> has been successfully added.
fr: <b>{object}</b> a été ajouté avec succès.

source: The form is valid but nothing has been added to database as <tt>save_to_database=False</tt>.
fr: Le formulaire est valide mais rien n'a été ajouté en base de données car <tt>save_to_database=False</tt>.

source: <b>{nb_updates} {model_verbose}</b> has been successfully updated.
fr: <b>{nb_updates} {model_verbose}</b> a été mis à jour avec succès.

source: The form is valid but nothing has been updated to database as <tt>save_to_database=False</tt>.
fr: Le formulaire est valide mais rien n'a été mis à jour en base de données car <tt>save_to_database=False</tt>.

source: You do not have the required permission
fr: Vous n'avez pas les permissions nécessaires

source: Please select at least one item in the listing
fr: Merci de selectionner au moins un élement

source: Please select one item
fr: Merci de sélection un élément

source: You can duplicate only one item at the same time
fr: Vous ne pouvez dupliquer qu'un élément à la fois

source: Please select at least one item
fr: Merci de selectionner au moins un élement
